/**
 * Created by Administrator on 2016/12/12.
 */



/**
 * config 自定义配置以及枚举
 */
app.factory('configUtis', function () {

    return {

        AUDIT_STATUS: {11:"未审核", 12:"身份证未上传",
            13:"身份证未上传", 21:"身份证已上传待审核",
            22:"身份证已上传待审核", 23:"身份证已上传待审核",
            31:"已审核", 32:"已审核", 33:"已审核"},

        PAY_TYPE: {1:"支付宝", 2:"微信"},

        PROJECT_TYPE: {1:"同城配送", 2:"生活服务", 3:"维修", 4:"推广", 6:"其他"},

        PROJECT_STATUS: {1:"待审核", 2:"待发布", 3:"已驳回", 4:"报名中", 5:"进行中", 6:"已结束", 7:"已取消"},

        RELEASE_TYPE:{0:"",1:"单独发布", 2:"集合发布"},

        RUNNER_LEVEL:{1:"普通佣兵",2:"专业骑手", 3:"精英骑手",4:"核心骑手",5:"佣兵队长"},

        ORDER_STATUS:{1:"待接单", 2:"待提货", 3:"配送中", 5:"已取消", 7:"已完成", 11:"准备中(2)", 12:"待提货(2)", 13:"配送中(2)"},

        TRADE_STATUS:{1:"交易成功", 2:"交易取消", 3:"申请中", 4:"处理中", 5:"失败"},

        ACCOUNT_TYPE:{1:"支付宝", 2:"对公账户"},
        PAY_STATUS:{1:"未支付", 2:"已支付", 3:"支付失败"},

        COMPANY_STATUS1:{1:"启用", 2:"禁用"},
        COMPANY_STATUS2:{1:"禁用", 2:"启用"},//工会账号

        CHANNEL:{gidoorWallet:"钱包支付",alipayQRcode:"支付宝扫码",alipay:"支付宝",wx:"微信支付",wx_pub:"微信公众号支付"},
        TRADE_TYPE:{1:"配送服务费",2:"代收款",3:"提现",4:"支付",5:"系统充值",6:"免单",7:"用户充值",8:"用户支付充值"},

        GENDER:{1:"男",2:"女",3:""},
        DEVICE_TYPE:{1:"IOS",2:"安卓",3:"微信",5:"PC"},
        MENU_TYPE:{1:"菜单",2:"功能"},

        CITY_NAME:{"021":"上海","0755":"深圳","0571":"杭州","0532":"青岛"}

    };
});

